{
    "description": "provisioning catalog",
    "documentation": [
        {
            "name": "WildFly documentation",
            "url": "https://docs.wildfly.org/"
        },
        {
            "name": "WildFly Glow documentation",
            "url": "https://docs.wildfly.org/wildfly-glow/"
        },
        {
            "name": "WildFly Maven Plugin documentation",
            "url": "https://docs.wildfly.org/wildfly-maven-plugin/"
        }
    ],
    "legend": {
        "layer": "The Galleon layer name to use to provision the feature.",
        "description": "The textual description of the layer.",
        "stability": "One of default, community, preview and experimental. community and default stability features are available by default.",
        "note": "To highlight a particularity that occurs when provisioning this layer.",
        "glowDiscoverable": "WildFly Glow (CLI or support in the WildFly Maven Plugin), can discover the layer from the API used in your deployment. If false, it must be added using the WildFly Glow addOn name.",
        "glowAddOn": "The name of the WildFly Glow addOn to use to provision this functionality when using Wildfly Glow.",
        "glowRules": "The list of rules that WildFly Glow uses to discover that your deployment requires this layer (API in use, expected XML descriptor, ...).",
        "feature-pack": "The Galleon feature-pack that defines the layer.",
        "managementModel": "The part of the management model this layer brings to the server configuration. Can be empty if this layer only aggregates some layers.",
        "dependencies": "The list of layers this layer depends on. Those layers are also provisioned when this layer is provisioned.",
        "configurations": "Environment variables and system properties that can be used to configure the layer.",
        "modelReference": "The Management API Reference of the resources that this feature-pack can provision",
        "logMessagesReference": "The log and exception messages codes and descriptions",
        "mavenCoordinates": "The Maven GroupId, ArtifactId and Version of the feature-pack",
        "featurePackLocation": " The XML content to configure the WildFly Maven Plugin to use this feature-pack",
        "packages": "The packages (generally JBoss Modules modules) that this layer provision in addition of implict extension module.",
        "licenses": "Licanes that cover the feature-pack",
        "scmURL": "Feature-pack sources URL"
    },
    "glowRulesDescriptions": "https://raw.githubusercontent.com/wildfly/wildfly-galleon-feature-packs/refs/heads/release/maven/docs/rules.properties",
    "baseMetadataURL": "https://raw.githubusercontent.com/wildfly/wildfly-galleon-feature-packs/refs/heads/release/catalog/###REPLACE_WILDFLY_VERSION###/"
}
